Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025dal169.h
extern volatile __GLCDCURDATA81bits_t GLCDCURDATA81bits __asm__ ("GLCDCURDATA81") __attribute__((section("sfrs"), address(0xBF8EA944)));
#define GLCDCURDATA82 GLCDCURDATA82
extern volatile uint32_t   GLCDCURDATA82 __attribute__((section("sfrs"), address(0xBF8EA948)));
typedef struct {
  uint32_t PIXEL2023:4;
  uint32_t PIXEL2022:4;
  uint32_t PIXEL2021:4;
  uint32_t PIXEL2020:4;
  uint32_t PIXEL2019:4;
  uint32_t PIXEL2018:4;
  uint32_t PIXEL2017:4;
  uint32_t PIXEL2016:4;
} __GLCDCURDATA82bits_t;
extern volatile __GLCDCURDATA82bits_t GLCDCURDATA82bits __asm__ ("GLCDCURDATA82") __attribute__((section("sfrs"), address(0xBF8EA948)));
#define GLCDCURDATA83 GLCDCURDATA83
extern volatile uint32_t   GLCDCURDATA83 __attribute__((section("sfrs"), address(0xBF8EA94C)));
typedef struct {
  uint32_t PIXEL2031:4;
  uint32_t PIXEL2030:4;
  uint32_t PIXEL2029:4;
  uint32_t PIXEL2028:4;
  uint32_t PIXEL2027:4;
  uint32_t PIXEL2026:4;
  uint32_t PIXEL2025:4;
  uint32_t PIXEL2024:4;
} __GLCDCURDATA83bits_t;
extern volatile __GLCDCURDATA83bits_t GLCDCURDATA83bits __asm__ ("GLCDCURDATA83") __attribute__((section("sfrs"), address(0xBF8EA94C)));
#define GLCDCURDATA84 GLCDCURDATA84
extern volatile uint32_t   GLCDCURDATA84 __attribute__((section("sfrs"), address(0xBF8EA950)));
typedef struct {
  uint32_t PIXEL217:4;
  uint32_t PIXEL216:4;
  uint32_t PIXEL215:4;
  uint32_t PIXEL214:4;
  uint32_t PIXEL213:4;
  uint32_t PIXEL212:4;
  uint32_t PIXEL211:4;
  uint32_t PIXEL210:4;
} __GLCDCURDATA84bits_t;
extern volatile __GLCDCURDATA84bits_t GLCDCURDATA84bits __asm__ ("GLCDCURDATA84") __attribute__((section("sfrs"), address(0xBF8EA950)));
#define GLCDCURDATA85 GLCDCURDATA85
extern volatile uint32_t   GLCDCURDATA85 __attribute__((section("sfrs"), address(0xBF8EA954)));
typedef struct {
  uint32_t PIXEL2115:4;
  uint32_t PIXEL2114:4;
  uint32_t PIXEL2113:4;
  uint32_t PIXEL2112:4;
  uint32_t PIXEL2111:4;
  uint32_t PIXEL2110:4;
  uint32_t PIXEL219:4;
  uint32_t PIXEL218:4;
} __GLCDCURDATA85bits_t;
extern volatile __GLCDCURDATA85bits_t GLCDCURDATA85bits __asm__ ("GLCDCURDATA85") __attribute__((section("sfrs"), address(0xBF8EA954)));
#define GLCDCURDATA86 GLCDCURDATA86
extern volatile uint32_t   GLCDCURDATA86 __attribute__((section("sfrs"), address(0xBF8EA958)));
typedef struct {
  uint32_t PIXEL2123:4;
  uint32_t PIXEL2122:4;
  uint32_t PIXEL2121:4;
  uint32_t PIXEL2120:4;
  uint32_t PIXEL2119:4;
  uint32_t PIXEL2118:4;
  uint32_t PIXEL2117:4;
  uint32_t PIXEL2116:4;
} __GLCDCURDATA86bits_t;
extern volatile __GLCDCURDATA86bits_t GLCDCURDATA86bits __asm__ ("GLCDCURDATA86") __attribute__((section("sfrs"), address(0xBF8EA958)));
#define GLCDCURDATA87 GLCDCURDATA87
extern volatile uint32_t   GLCDCURDATA87 __attribute__((section("sfrs"), address(0xBF8EA95C)));
typedef struct {
  uint32_t PIXEL2131:4;
  uint32_t PIXEL2130:4;
  uint32_t PIXEL2129:4;
  uint32_t PIXEL2128:4;
  uint32_t PIXEL2127:4;
  uint32_t PIXEL2126:4;
  uint32_t PIXEL2125:4;
  uint32_t PIXEL2124:4;
} __GLCDCURDATA87bits_t;
extern volatile __GLCDCURDATA87bits_t GLCDCURDATA87bits __asm__ ("GLCDCURDATA87") __attribute__((section("sfrs"), address(0xBF8EA95C)));
#define GLCDCURDATA88 GLCDCURDATA88
extern volatile uint32_t   GLCDCURDATA88 __attribute__((section("sfrs"), address(0xBF8EA960)));
typedef struct {
  uint32_t PIXEL227:4;
  uint32_t PIXEL226:4;
  uint32_t PIXEL225:4;
  uint32_t PIXEL224:4;
  uint32_t PIXEL223:4;
  uint32_t PIXEL222:4;
  uint32_t PIXEL221:4;
  uint32_t PIXEL220:4;
} __GLCDCURDATA88bits_t;
extern volatile __GLCDCURDATA88bits_t GLCDCURDATA88bits __asm__ ("GLCDCURDATA88") __attribute__((section("sfrs"), address(0xBF8EA960)));
#define GLCDCURDATA89 GLCDCURDATA89
extern volatile uint32_t   GLCDCURDATA89 __attribute__((section("sfrs"), address(0xBF8EA964)));
typedef struct {
  uint32_t PIXEL2215:4;
  uint32_t PIXEL2214:4;
  uint32_t PIXEL2213:4;
  uint32_t PIXEL2212:4;
  uint32_t PIXEL2211:4;
  uint32_t PIXEL2210:4;
  uint32_t PIXEL229:4;
  uint32_t PIXEL228:4;
} __GLCDCURDATA89bits_t;
extern volatile __GLCDCURDATA89bits_t GLCDCURDATA89bits __asm__ ("GLCDCURDATA89") __attribute__((section("sfrs"), address(0xBF8EA964)));
#define GLCDCURDATA90 GLCDCURDATA90
extern volatile uint32_t   GLCDCURDATA90 __attribute__((section("sfrs"), address(0xBF8EA968)));
typedef struct {
  uint32_t PIXEL2223:4;
  uint32_t PIXEL2222:4;
  uint32_t PIXEL2221:4;
  uint32_t PIXEL2220:4;
  uint32_t PIXEL2219:4;
  uint32_t PIXEL2218:4;
  uint32_t PIXEL2217:4;
  uint32_t PIXEL2216:4;
} __GLCDCURDATA90bits_t;
extern volatile __GLCDCURDATA90bits_t GLCDCURDATA90bits __asm__ ("GLCDCURDATA90") __attribute__((section("sfrs"), address(0xBF8EA968)));
#define GLCDCURDATA91 GLCDCURDATA91
extern volatile uint32_t   GLCDCURDATA91 __attribute__((section("sfrs"), address(0xBF8EA96C)));
typedef struct {
  uint32_t PIXEL2231:4;
  uint32_t PIXEL2230:4;
  uint32_t PIXEL2229:4;
  uint32_t PIXEL2228:4;
  uint32_t PIXEL2227:4;
  uint32_t PIXEL2226:4;
  uint32_t PIXEL2225:4;
  uint32_t PIXEL2224:4;
} __GLCDCURDATA91bits_t;
extern volatile __GLCDCURDATA91bits_t GLCDCURDATA91bits __asm__ ("GLCDCURDATA91") __attribute__((section("sfrs"), address(0xBF8EA96C)));
#define GLCDCURDATA92 GLCDCURDATA92
extern volatile uint32_t   GLCDCURDATA92 __attribute__((section("sfrs"), address(0xBF8EA970)));
typedef struct {
  uint32_t PIXEL237:4;
  uint32_t PIXEL236:4;
  uint32_t PIXEL235:4;
  uint32_t PIXEL234:4;
  uint32_t PIXEL233:4;
  uint32_t PIXEL232:4;
  uint32_t PIXEL231:4;
  uint32_t PIXEL230:4;
} __GLCDCURDATA92bits_t;
extern volatile __GLCDCURDATA92bits_t GLCDCURDATA92bits __asm__ ("GLCDCURDATA92") __attribute__((section("sfrs"), address(0xBF8EA970)));
#define GLCDCURDATA93 GLCDCURDATA93
extern volatile uint32_t   GLCDCURDATA93 __attribute__((section("sfrs"), address(0xBF8EA974)));
typedef struct {
  uint32_t PIXEL2315:4;
  uint32_t PIXEL2314:4;
  uint32_t PIXEL2313:4;
  uint32_t PIXEL2312:4;
  uint32_t PIXEL2311:4;
  uint32_t PIXEL2310:4;
  uint32_t PIXEL239:4;
  uint32_t PIXEL238:4;
} __GLCDCURDATA93bits_t;
